In [28]:
import pandas as pd 
from sqlite3 import  connect

In [17]:
'''
conn = mysql.connector.connect(
    host="localhost",
    user="yourusername",
    password="yourpassword",
    port=9999
)
'''

'\nconn = mysql.connector.connect(\n    host="localhost",\n    user="yourusername",\n    password="yourpassword",\n    port=9999\n)\n'

# Criar tabelas na DB

In [21]:
conn = connect("teste.db")
cur = conn.cursor()

In [18]:
cur.execute('''CREATE TABLE IF NOT EXISTS STUDENT
(student_id INTEGER PRIMARY KEY,
student_name TEXT,
course TEXT,
marks INTEGER)
''')

# Add dados

In [19]:
cur.execute('''INSERT INTO STUDENT (student_id, student_name, course, marks)
VALUES (1, 'Mark', 'Python', 65),
(2, 'Alice', 'Maths', 55),
(3, 'Bob', 'Linux', 68),
(4, 'Emily', 'English', 50)
''')

conn.commit()

IntegrityError: UNIQUE constraint failed: STUDENT.student_id

# Ler dados

In [22]:
sql_query = pd.read_sql('SELECT * FROM STUDENT', conn)

sql_query

   student_id student_name   course  marks
0           1         Mark   Python     65
1           2        Alice    Maths     55
2           3          Bob    Linux     68
3           4        Emily  English     50

In [23]:
df = pd.DataFrame(sql_query)
df

   student_id student_name   course  marks
0           1         Mark   Python     65
1           2        Alice    Maths     55
2           3          Bob    Linux     68
3           4        Emily  English     50

In [24]:
sql_query = pd.read_sql('SELECT * FROM STUDENT', conn, index_col="student_id")

sql_query

           student_name   course  marks
student_id
1                  Mark   Python     65
2                 Alice    Maths     55
3                   Bob    Linux     68
4                 Emily  English     50

In [25]:
sql_query = pd.read_sql('SELECT * FROM STUDENT', conn)

my_df = pd.DataFrame(sql_query, columns=["student_name", "marks"])
my_df

  student_name  marks
0         Mark     65
1        Alice     55
2          Bob     68
3        Emily     50

In [26]:
my_df = pd.DataFrame(sql_query, columns=["marks", "course"])
my_df

   marks   course
0     65   Python
1     55    Maths
2     68    Linux
3     50  English

In [27]:
sql_query = pd.read_sql('SELECT student_name,marks FROM STUDENT', conn)

sql_query

  student_name  marks
0         Mark     65
1        Alice     55
2          Bob     68
3        Emily     50

# loc vs iloc

In [39]:
df = pd.read_csv("UID_ISO_FIPS_LookUp_Table.csv")
df

,UID,iso2,iso3,code3,FIPS,Admin2,Province_State,Country_Region,Lat,Long_,Combined_Key,Population
0,4,AF,AFG,4.0,NaN,NaN,NaN,Afghanistan,33.939110,67.709953,Afghanistan,38928341.0
1,8,AL,ALB,8.0,NaN,NaN,NaN,Albania,41.153300,20.168300,Albania,2877800.0
2,10,AQ,ATA,10.0,NaN,NaN,NaN,Antarctica,-71.949900,23.347000,Antarctica,NaN
3,12,DZ,DZA,12.0,NaN,NaN,NaN,Algeria,28.033900,1.659600,Algeria,43851043.0
4,20,AD,AND,20.0,NaN,NaN,NaN,Andorra,42.506300,1.521800,Andorra,77265.0
...,...,...,...,...,...,...,...,...,...,...,...,...
4316,84056037,US,USA,840.0,56037.0,Sweetwater,Wyoming,US,41.659439,-108.882788,"Sweetwater, Wyoming, US",42343.0
4317,84056039,US,USA,840.0,56039.0,Teton,Wyoming,US,43.935225,-110.589080,"Teton, Wyoming, US",23464.0
4318,84056041,US,USA,840.0,56041.0,Uinta,Wyoming,US,41.287818,-110.547578,"Uinta, Wyoming, US",20226.0
4319,84056043,US,USA,840.0,56043.0,Washakie,Wyoming,US,43.904516,-107.680187,"Washakie, Wyoming, US",7805.0
4320,84056045,US,USA,840.0,56045.0,Weston,Wyoming,US,43.839612,-104.567488,"Weston, Wyoming, US",6927.0

In [32]:
df.loc[1:5]

,UID,iso2,iso3,code3,FIPS,Admin2,Province_State,Country_Region,Lat,Long_,Combined_Key,Population
1,8,AL,ALB,8.0,NaN,NaN,NaN,Albania,41.1533,20.1683,Albania,2877800.0
2,10,AQ,ATA,10.0,NaN,NaN,NaN,Antarctica,-71.9499,23.3470,Antarctica,NaN
3,12,DZ,DZA,12.0,NaN,NaN,NaN,Algeria,28.0339,1.6596,Algeria,43851043.0
4,20,AD,AND,20.0,NaN,NaN,NaN,Andorra,42.5063,1.5218,Andorra,77265.0
5,24,AO,AGO,24.0,NaN,NaN,NaN,Angola,-11.2027,17.8739,Angola,32866268.0

In [35]:
df.iloc[[1,5,10,20]]

,UID,iso2,iso3,code3,FIPS,Admin2,Province_State,Country_Region,Lat,Long_,Combined_Key,Population
1,8,AL,ALB,8.0,NaN,NaN,NaN,Albania,41.1533,20.1683,Albania,2877800.0
5,24,AO,AGO,24.0,NaN,NaN,NaN,Angola,-11.2027,17.8739,Angola,32866268.0
10,31,AZ,AZE,31.0,NaN,NaN,NaN,Azerbaijan,40.1431,47.5769,Azerbaijan,10139175.0
20,5604,BE,BEL,56.0,NaN,NaN,Flemish Brabant,Belgium,50.9167,4.5833,"Flemish Brabant, Belgium",1155843.0

In [40]:
new_df = df.set_index("iso2")

new_df

,UID,iso3,code3,FIPS,Admin2,Province_State,Country_Region,Lat,Long_,Combined_Key,Population
iso2,,,,,,,,,,,
AF,4,AFG,4.0,NaN,NaN,NaN,Afghanistan,33.939110,67.709953,Afghanistan,38928341.0
AL,8,ALB,8.0,NaN,NaN,NaN,Albania,41.153300,20.168300,Albania,2877800.0
AQ,10,ATA,10.0,NaN,NaN,NaN,Antarctica,-71.949900,23.347000,Antarctica,NaN
DZ,12,DZA,12.0,NaN,NaN,NaN,Algeria,28.033900,1.659600,Algeria,43851043.0
AD,20,AND,20.0,NaN,NaN,NaN,Andorra,42.506300,1.521800,Andorra,77265.0
...,...,...,...,...,...,...,...,...,...,...,...
US,84056037,USA,840.0,56037.0,Sweetwater,Wyoming,US,41.659439,-108.882788,"Sweetwater, Wyoming, US",42343.0
US,84056039,USA,840.0,56039.0,Teton,Wyoming,US,43.935225,-110.589080,"Teton, Wyoming, US",23464.0
US,84056041,USA,840.0,56041.0,Uinta,Wyoming,US,41.287818,-110.547578,"Uinta, Wyoming, US",20226.0
US,84056043,USA,840.0,56043.0,Washakie,Wyoming,US,43.904516,-107.680187,"Washakie, Wyoming, US",7805.0
US,84056045,USA,840.0,56045.0,Weston,Wyoming,US,43.839612,-104.567488,"Weston, Wyoming, US",6927.0

In [41]:
df.set_index("iso2", inplace=True) # df = df.set_index("iso2")

df

,UID,iso3,code3,FIPS,Admin2,Province_State,Country_Region,Lat,Long_,Combined_Key,Population
iso2,,,,,,,,,,,
AF,4,AFG,4.0,NaN,NaN,NaN,Afghanistan,33.939110,67.709953,Afghanistan,38928341.0
AL,8,ALB,8.0,NaN,NaN,NaN,Albania,41.153300,20.168300,Albania,2877800.0
AQ,10,ATA,10.0,NaN,NaN,NaN,Antarctica,-71.949900,23.347000,Antarctica,NaN
DZ,12,DZA,12.0,NaN,NaN,NaN,Algeria,28.033900,1.659600,Algeria,43851043.0
AD,20,AND,20.0,NaN,NaN,NaN,Andorra,42.506300,1.521800,Andorra,77265.0
...,...,...,...,...,...,...,...,...,...,...,...
US,84056037,USA,840.0,56037.0,Sweetwater,Wyoming,US,41.659439,-108.882788,"Sweetwater, Wyoming, US",42343.0
US,84056039,USA,840.0,56039.0,Teton,Wyoming,US,43.935225,-110.589080,"Teton, Wyoming, US",23464.0
US,84056041,USA,840.0,56041.0,Uinta,Wyoming,US,41.287818,-110.547578,"Uinta, Wyoming, US",20226.0
US,84056043,USA,840.0,56043.0,Washakie,Wyoming,US,43.904516,-107.680187,"Washakie, Wyoming, US",7805.0
US,84056045,USA,840.0,56045.0,Weston,Wyoming,US,43.839612,-104.567488,"Weston, Wyoming, US",6927.0

In [42]:
df.loc[2]

KeyError: 2

In [45]:
df.iloc[[2,10,5,18]]

,UID,iso3,code3,FIPS,Admin2,Province_State,Country_Region,Lat,Long_,Combined_Key,Population
iso2,,,,,,,,,,,
AQ,10,ATA,10.0,NaN,NaN,NaN,Antarctica,-71.9499,23.3470,Antarctica,NaN
AZ,31,AZE,31.0,NaN,NaN,NaN,Azerbaijan,40.1431,47.5769,Azerbaijan,10139175.0
AO,24,AGO,24.0,NaN,NaN,NaN,Angola,-11.2027,17.8739,Angola,32866268.0
BE,5602,BEL,56.0,NaN,NaN,Brussels,Belgium,50.8503,4.3517,"Brussels, Belgium",1218255.0

In [46]:
df.loc["BE"]

,UID,iso3,code3,FIPS,Admin2,Province_State,Country_Region,Lat,Long_,Combined_Key,Population
iso2,,,,,,,,,,,
BE,56,BEL,56.0,NaN,NaN,NaN,Belgium,50.8333,4.469936,Belgium,11492641.0
BE,5601,BEL,56.0,NaN,NaN,Antwerp,Belgium,51.2195,4.402400,"Antwerp, Belgium",1869730.0
BE,5602,BEL,56.0,NaN,NaN,Brussels,Belgium,50.8503,4.351700,"Brussels, Belgium",1218255.0
BE,5603,BEL,56.0,NaN,NaN,East Flanders,Belgium,51.0362,3.737300,"East Flanders, Belgium",1525255.0
BE,5604,BEL,56.0,NaN,NaN,Flemish Brabant,Belgium,50.9167,4.583300,"Flemish Brabant, Belgium",1155843.0
BE,5605,BEL,56.0,NaN,NaN,Hainaut,Belgium,50.5257,4.062100,"Hainaut, Belgium",1346840.0
BE,5606,BEL,56.0,NaN,NaN,Liege,Belgium,50.4496,5.849200,"Liege, Belgium",1109800.0
BE,5607,BEL,56.0,NaN,NaN,Limburg,Belgium,50.9739,5.342000,"Limburg, Belgium",877370.0
BE,5608,BEL,56.0,NaN,NaN,Luxembourg,Belgium,50.0547,5.467700,"Luxembourg, Belgium",286752.0
BE,5609,BEL,56.0,NaN,NaN,Namur,Belgium,50.3310,4.822100,"Namur, Belgium",495832.0
BE,5610,BEL,56.0,NaN,NaN,Unknown,Belgium,NaN,NaN,"Unknown, Belgium",NaN
BE,5611,BEL,56.0,NaN,NaN,Walloon Brabant,Belgium,50.4000,4.350000,"Walloon Brabant, Belgium",406019.0
BE,5612,BEL,56.0,NaN,NaN,West Flanders,Belgium,51.0536,3.145800,"West Flanders, Belgium",1200945.0

In [54]:
df.loc["BE"].sort_values("Population", ascending=True).iloc[0].loc["Province_State"]

'Luxembourg'